       identification division.
       program-id. hello.

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.
       MAIN-LOGIC SECTION.
             BEGIN.
            display "Hello world! I am".
            STOP RUN.
            MAIN-LOGIC-EXIT.
            EXIT. 
           goback.
           
       end program hello.